#pragma once
#include <d3d11.h>

#define PROTOCOL 1

namespace game
{
	typedef float vec_t;
	typedef vec_t vec2_t[2];
	typedef vec_t vec3_t[3];
	typedef vec_t vec4_t[4];

	enum scr_string_t : std::int32_t
	{
	};

	struct CmdArgs
	{
		int nesting;
		int localClientNum[8];
		int controllerIndex[8];
		int argc[8];
		const char** argv[8];
	};

	struct cmd_function_s
	{
		cmd_function_s* next;
		const char* name;
		void(__cdecl* function)();
	};

	enum DvarSetSource : std::uint32_t
	{
		DVAR_SOURCE_INTERNAL = 0x0,
		DVAR_SOURCE_EXTERNAL = 0x1,
		DVAR_SOURCE_SCRIPT = 0x2,
		DVAR_SOURCE_UISCRIPT = 0x3,
		DVAR_SOURCE_SERVERCMD = 0x4,
		DVAR_SOURCE_NUM = 0x5,
	};

	enum DvarFlags : std::uint32_t
	{
		DVAR_FLAG_NONE = 0,
		DVAR_FLAG_SAVED = 0x1,
		DVAR_FLAG_LATCHED = 0x2,
		DVAR_FLAG_CHEAT = 0x4,
		DVAR_FLAG_REPLICATED = 0x8,
		DVAR_FLAG_WRITE = 0x800,
		DVAR_FLAG_READ = 0x2000,
	};

	enum dvar_type : std::int8_t
	{
		boolean = 0,
		value = 1,
		vec2 = 2,
		vec3 = 3,
		vec4 = 4,
		integer = 5,
		enumeration = 6,
		string = 7,
		color = 8,
		rgb = 9 // Color without alpha
	};

	union dvar_value
	{
		bool enabled;
		int integer;
		unsigned int unsignedInt;
		float value;
		float vector[4];
		const char* string;
		char color[4];
	};

	struct $A37BA207B3DDD6345C554D4661813EDD
	{
		int stringCount;
		const char* const* strings;
	};

	struct $9CA192F9DB66A3CB7E01DE78A0DEA53D
	{
		int min;
		int max;
	};

	struct $251C2428A496074035CACA7AAF3D55BD
	{
		float min;
		float max;
	};

	union dvar_limits
	{
		$A37BA207B3DDD6345C554D4661813EDD enumeration;
		$9CA192F9DB66A3CB7E01DE78A0DEA53D integer;
		$251C2428A496074035CACA7AAF3D55BD value;
		$251C2428A496074035CACA7AAF3D55BD vector;
	};

	struct dvar_t
	{
		int hash; // 0
		unsigned int flags; // 4
		bool unk; // 8 tls value?
		dvar_type type; // 9
		bool modified; // 10
		dvar_value current; // 16
		dvar_value latched; // 32
		dvar_value reset; // 48
		dvar_limits domain; // 64
		char unk2; // 80 always 0?
		void* unk3; // 88 some pointer related to hash?
	}; static_assert(sizeof(dvar_t) == 96);

	enum svscmd_type
	{
		SV_CMD_CAN_IGNORE = 0x0,
		SV_CMD_RELIABLE = 0x1,
	};

	enum keyNum_t
	{
		K_NONE = 0x0,
		K_FIRSTGAMEPADBUTTON_RANGE_1 = 0x1,
		K_BUTTON_A = 0x1,
		K_BUTTON_B = 0x2,
		K_BUTTON_X = 0x3,
		K_BUTTON_Y = 0x4,
		K_BUTTON_LSHLDR = 0x5,
		K_BUTTON_RSHLDR = 0x6,
		K_LASTGAMEPADBUTTON_RANGE_1 = 0x6,
		K_BS = 0x8,
		K_TAB = 0x9,
		K_ENTER = 0xD,
		K_FIRSTGAMEPADBUTTON_RANGE_2 = 0xE,
		K_BUTTON_START = 0xE,
		K_BUTTON_BACK = 0xF,
		K_BUTTON_LSTICK = 0x10,
		K_BUTTON_RSTICK = 0x11,
		K_BUTTON_LTRIG = 0x12,
		K_BUTTON_RTRIG = 0x13,
		K_DPAD_UP = 0x14,
		K_FIRSTDPAD = 0x14,
		K_DPAD_DOWN = 0x15,
		K_DPAD_LEFT = 0x16,
		K_DPAD_RIGHT = 0x17,
		K_BUTTON_LSTICK_ALTIMAGE2 = 0x10,
		K_BUTTON_RSTICK_ALTIMAGE2 = 0x11,
		K_BUTTON_LSTICK_ALTIMAGE = 0xBC,
		K_BUTTON_RSTICK_ALTIMAGE = 0xBD,
		K_LASTDPAD = 0x17,
		K_LASTGAMEPADBUTTON_RANGE_2 = 0x17,
		K_ESCAPE = 0x1B,
		K_FIRSTGAMEPADBUTTON_RANGE_3 = 0x1C,
		K_APAD_UP = 0x1C,
		K_FIRSTAPAD = 0x1C,
		K_APAD_DOWN = 0x1D,
		K_APAD_LEFT = 0x1E,
		K_APAD_RIGHT = 0x1F,
		K_LASTAPAD = 0x1F,
		K_LASTGAMEPADBUTTON_RANGE_3 = 0x1F,
		K_SPACE = 0x20,
		K_GRAVE = 0x60,
		K_TILDE = 0x7E,
		K_BACKSPACE = 0x7F,
		K_ASCII_FIRST = 0x80,
		K_ASCII_181 = 0x80,
		K_ASCII_191 = 0x81,
		K_ASCII_223 = 0x82,
		K_ASCII_224 = 0x83,
		K_ASCII_225 = 0x84,
		K_ASCII_228 = 0x85,
		K_ASCII_229 = 0x86,
		K_ASCII_230 = 0x87,
		K_ASCII_231 = 0x88,
		K_ASCII_232 = 0x89,
		K_ASCII_233 = 0x8A,
		K_ASCII_236 = 0x8B,
		K_ASCII_241 = 0x8C,
		K_ASCII_242 = 0x8D,
		K_ASCII_243 = 0x8E,
		K_ASCII_246 = 0x8F,
		K_ASCII_248 = 0x90,
		K_ASCII_249 = 0x91,
		K_ASCII_250 = 0x92,
		K_ASCII_252 = 0x93,
		K_END_ASCII_CHARS = 0x94,
		K_COMMAND = 0x96,
		K_CAPSLOCK = 0x97,
		K_POWER = 0x98,
		K_PAUSE = 0x99,
		K_UPARROW = 0x9A,
		K_DOWNARROW = 0x9B,
		K_LEFTARROW = 0x9C,
		K_RIGHTARROW = 0x9D,
		K_ALT = 0x9E,
		K_CTRL = 0x9F,
		K_SHIFT = 0xA0,
		K_INS = 0xA1,
		K_DEL = 0xA2,
		K_PGDN = 0xA3,
		K_PGUP = 0xA4,
		K_HOME = 0xA5,
		K_END = 0xA6,
		K_F1 = 0xA7,
		K_F2 = 0xA8,
		K_F3 = 0xA9,
		K_F4 = 0xAA,
		K_F5 = 0xAB,
		K_F6 = 0xAC,
		K_F7 = 0xAD,
		K_F8 = 0xAE,
		K_F9 = 0xAF,
		K_F10 = 0xB0,
		K_F11 = 0xB1,
		K_F12 = 0xB2,
		K_F13 = 0xB3,
		K_F14 = 0xB4,
		K_F15 = 0xB5,
		K_KP_HOME = 0xB6,
		K_KP_UPARROW = 0xB7,
		K_KP_PGUP = 0xB8,
		K_KP_LEFTARROW = 0xB9,
		K_KP_5 = 0xBA,
		K_KP_RIGHTARROW = 0xBB,
		K_KP_END = 0xBC,
		K_KP_DOWNARROW = 0xBD,
		K_KP_PGDN = 0xBE,
		K_KP_ENTER = 0xBF,
		K_KP_INS = 0xC0,
		K_KP_DEL = 0xC1,
		K_KP_SLASH = 0xC2,
		K_KP_MINUS = 0xC3,
		K_KP_PLUS = 0xC4,
		K_KP_NUMLOCK = 0xC5,
		K_KP_STAR = 0xC6,
		K_KP_EQUALS = 0xC7,
		K_MOUSE1 = 0xC8,
		K_MOUSE2 = 0xC9,
		K_MOUSE3 = 0xCA,
		K_MOUSE4 = 0xCB,
		K_MOUSE5 = 0xCC,
		K_MWHEELDOWN = 0xCD,
		K_MWHEELUP = 0xCE,
		K_AUX1 = 0xCF,
		K_AUX2 = 0xD0,
		K_AUX3 = 0xD1,
		K_AUX4 = 0xD2,
		K_AUX5 = 0xD3,
		K_AUX6 = 0xD4,
		K_AUX7 = 0xD5,
		K_AUX8 = 0xD6,
		K_AUX9 = 0xD7,
		K_AUX10 = 0xD8,
		K_AUX11 = 0xD9,
		K_AUX12 = 0xDA,
		K_AUX13 = 0xDB,
		K_AUX14 = 0xDC,
		K_AUX15 = 0xDD,
		K_AUX16 = 0xDE,
		K_LAST_KEY = 0xDF
	};

	struct KeyState
	{
		int down;
		int unk;
		int repeats;
		int unk2;
	};

	struct field_t
	{
		int cursor;
		int scroll;
		int drawWidth;
		int widthInPixels;
		float charHeight;
		int fixedSize;
		char buffer[256];
	};

	struct PlayerKeyState
	{
		int overstrikeMode;
		int anyKeyDown;
		KeyState keys[256];
		field_t test;
		char __pad0[8];
	}; static_assert(sizeof(PlayerKeyState) == 0x1128);

	struct ScreenPlacement
	{
		vec2_t scaleVirtualToReal;
		vec2_t scaleVirtualToFull;
		vec2_t scaleRealToVirtual;
		vec2_t realViewportPosition;
		vec2_t realViewportSize;
		vec2_t virtualViewableMin;
		vec2_t virtualViewableMax;
		vec2_t realViewableMin;
		vec2_t realViewableMax;
		vec2_t virtualAdjustableMin;
		vec2_t virtualAdjustableMax;
		vec2_t realAdjustableMin;
		vec2_t realAdjustableMax;
		vec2_t subScreenLeft;
	};

	enum netadrtype_t
	{
		NA_BOT = 0x0,
		NA_BAD = 0x1,
		NA_LOOPBACK = 0x2,
		NA_BROADCAST = 0x3,
		NA_IP = 0x4,
	};

	enum netsrc_t
	{
		NS_CLIENT1 = 0x0,
		NS_MAXCLIENTS = 0x1,
		NS_SERVER = 0x2,
		NS_PACKET = 0x3,
		NS_INVALID_NETSRC = 0x4,
	};

	struct netadr_s
	{
		netadrtype_t type;
		unsigned char ip[4];
		unsigned __int16 port;
		netsrc_t localNetID;
		unsigned int addrHandleIndex;
	};

	namespace entity
	{
		struct entityState_t
		{
			__int16 number; // 0
		}; // sizeof = ?

		struct gclient_s
		{
			char __pad0[19376];
			char name[32]; // 19376
			char __pad1[1516];
			int flags; // 20924
		}; // sizeof = 29208?

		static_assert(offsetof(gclient_s, name) == 19376);
		static_assert(offsetof(gclient_s, flags) == 20924);

#pragma pack(push, 1)
		struct gentity_s
		{
			entityState_t s; // 0
			char __pad0[368 - sizeof(entityState_t)];
			gclient_s* client; // 368
			char __pad1[80];
			int flags; // 456
			char __pad3[556];
		}; static_assert(sizeof(gentity_s) == 1016);
#pragma pack(pop)

		static_assert(offsetof(gentity_s, client) == 368);
		static_assert(offsetof(gentity_s, flags) == 456);

		struct clientHeader_t
		{
			char __pad0[8];
			int state; // 8
		}; // sizeof = ?

		struct client_t
		{
			clientHeader_t header; // 0
			char __pad0[124];
			gentity_s* gentity; // 136
			char __pad1[1044];
			char name[32]; // 1188
			char __pad2[714196];
		}; static_assert(sizeof(client_t) == 715416);

		static_assert(offsetof(client_t, gentity) == 136);
		static_assert(offsetof(client_t, name) == 1188);
	}
	using namespace entity;

	namespace assets
	{
		enum XAssetType : std::int32_t
		{
			ASSET_TYPE_PHYSICSLIBRARY = 0,
			ASSET_TYPE_PHYSICS_SFX_EVENT_ASSET = 1,
			ASSET_TYPE_PHYSICS_VFX_EVENT_ASSET = 2,
			ASSET_TYPE_PHYSICSASSET = 3,
			ASSET_TYPE_PHYSICS_FX_PIPELINE = 4,
			ASSET_TYPE_PHYSICS_FX_SHAPE = 5,
			ASSET_TYPE_XANIMPARTS = 6,
			ASSET_TYPE_XMODEL_SURFS = 7,
			ASSET_TYPE_XMODEL = 8,
			ASSET_TYPE_MAYHEM = 9,
			ASSET_TYPE_MATERIAL = 10,
			ASSET_TYPE_COMPUTESHADER = 11,
			ASSET_TYPE_VERTEXSHADER = 12,
			ASSET_TYPE_HULLSHADER = 13,
			ASSET_TYPE_DOMAINSHADER = 14,
			ASSET_TYPE_PIXELSHADER = 15,
			ASSET_TYPE_VERTEXDECL = 16,
			ASSET_TYPE_TECHNIQUE_SET = 17,
			ASSET_TYPE_IMAGE = 18,
			ASSET_TYPE_SOUND_GLOBALS = 19,
			ASSET_TYPE_SOUND_BANK = 20,
			ASSET_TYPE_SOUND_BANK_TRANSIENT = 21,
			ASSET_TYPE_CLIPMAP = 22,
			ASSET_TYPE_COMWORLD = 23,
			ASSET_TYPE_GLASSWORLD = 24,
			ASSET_TYPE_PATHDATA = 25,
			ASSET_TYPE_NAVMESH = 26,
			ASSET_TYPE_MAP_ENTS = 27,
			ASSET_TYPE_FXWORLD = 28,
			ASSET_TYPE_GFXWORLD = 29,
			ASSET_TYPE_GFXWORLD_TRANSIENT_ZONE = 30,
			ASSET_TYPE_IESPROFILE = 31, // unused
			ASSET_TYPE_LIGHT_DEF = 32,
			ASSET_TYPE_UI_MAP = 33, // unused
			ASSET_TYPE_ANIMCLASS = 34,
			ASSET_TYPE_PLAYERANIM = 35,
			ASSET_TYPE_GESTURE = 36,
			ASSET_TYPE_LOCALIZE_ENTRY = 37,
			ASSET_TYPE_ATTACHMENT = 38,
			ASSET_TYPE_WEAPON = 39,
			ASSET_TYPE_VFX = 40,
			ASSET_TYPE_IMPACT_FX = 41, // not confirmed
			ASSET_TYPE_SURFACE_FX = 42, // not confirmed
			ASSET_TYPE_AITYPE = 43, // not confirmed + unused
			ASSET_TYPE_MPTYPE = 44, // not confirmed + unused
			ASSET_TYPE_CHARACTER = 45, // not confirmed + unused
			ASSET_TYPE_XMODELALIAS = 46, // not confirmed + unused
			ASSET_TYPE_UNKNOWN = 47, // not confirmed + unused
			ASSET_TYPE_RAWFILE = 48,
			ASSET_TYPE_SCRIPTFILE = 49,
			ASSET_TYPE_STRINGTABLE = 50,
			ASSET_TYPE_LEADERBOARD = 51,
			ASSET_TYPE_VIRTUAL_LEADERBOARD = 52,
			ASSET_TYPE_STRUCTUREDDATADEF = 53,
			ASSET_TYPE_DDL = 54,
			ASSET_TYPE_TRACER = 55,
			ASSET_TYPE_VEHICLE = 56,
			ASSET_TYPE_ADDON_MAP_ENTS = 57,
			ASSET_TYPE_NET_CONST_STRINGS = 58,
			ASSET_TYPE_LUA_FILE = 59,
			ASSET_TYPE_SCRIPTABLE = 60,
			ASSET_TYPE_EQUIPMENT_SND_TABLE = 61,
			ASSET_TYPE_VECTORFIELD = 62,
			ASSET_TYPE_PARTICLE_SIM_ANIMATION = 63,
			ASSET_TYPE_STREAMING_INFO = 64,
			ASSET_TYPE_LASER = 65,
			ASSET_TYPE_TTF = 66,
			ASSET_TYPE_SUIT = 67,
			ASSET_TYPE_SUITANIMPACKAGE = 68,
			ASSET_TYPE_SPACESHIPTARGET = 69,
			ASSET_TYPE_RUMBLE = 70,
			ASSET_TYPE_RUMBLE_GRAPH = 71,
			ASSET_TYPE_ANIM_PACKAGE = 72,
			ASSET_TYPE_SFX_PACKAGE = 73,
			ASSET_TYPE_VFX_PACKAGE = 74,
			ASSET_TYPE_BEHAVIOR_TREE = 75,
			ASSET_TYPE_XANIM_ARCHETYPE = 76,
			ASSET_TYPE_XANIM_PROCEDURALBONES = 77,
			ASSET_TYPE_RETICLE = 78,
			ASSET_TYPE_GFXLIGHTMAP = 79,
			ASSET_TYPE_COUNT = 80
		};

		struct PhysicsLibrary
		{
			const char* name;
			bool isMaterialList;
			bool isBodyQualityList;
			bool isMotionPropertiesList;
			bool isGlobalTypeCompendium;
			unsigned int havokDataSize;
			char* havokData;
		}; static_assert(sizeof(PhysicsLibrary) == 0x18);

		struct PhysicsSFXEventAssetRule;
		struct PhysicsSFXEventAssetRules
		{
			int numrules;
			PhysicsSFXEventAssetRule* rules;
		};

		enum PhysicsSFXEventAssetRuleType
		{
			Types_PhysicsSFXEventRule = 0x0,
			Types_PhysicsSFXEventSoundRule = 0x1,
			Types_PhysicsSFXEventMaterialRule = 0x2,
			Types_PhysicsSFXEventAngleRule = 0x3,
			Types_PhysicsSFXEventSpeedRule = 0x4,
			Types_PhysicsSFXEventMassRule = 0x5,
			Types_PhysicsSFXEventGravityRule = 0x6,
			Types_PhysicsSFXEventAtmosphereRule = 0x7,
			Types_PhysicsSFXEventCameraDistanceRule = 0x8,
			Types_PhysicsSFXEventFrequencyRule = 0x9,
			Types_PhysicsSFXEventRuleCount = 0xA,
		};

		struct PhysicsSFXEventAssetSoundRule
		{
			char* hitSoundAlias;
			char* scrapeSoundAlias;
			float scrapeSoundVolumeSpeedThresholdMin;
			float scrapeSoundVolumeSpeedThresholdMax;
			float scrapeSoundVolumeBlendSpeed;
		};

		struct PhysicsSFXEventAssetMaterialEntry
		{
			int surfaceType;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetMaterialRule
		{
			int numentries;
			PhysicsSFXEventAssetMaterialEntry* entries;
		};

		struct PhysicsSFXEventAssetAngleEntry
		{
			float angle;
			float hitSoundVolumeModifierMin;
			float hitSoundVolumeModifierMax;
			float hitSoundPitchModifierMin;
			float hitSoundPitchModifierMax;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetAngleRule
		{
			int numentries;
			PhysicsSFXEventAssetAngleEntry* entries;
		};

		struct PhysicsSFXEventAssetSpeedEntry
		{
			float speedThreshold;
			float hitSoundVolumeModifierMin;
			float hitSoundVolumeModifierMax;
			float hitSoundPitchModifierMin;
			float hitSoundPitchModifierMax;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetSpeedRule
		{
			int numentries;
			PhysicsSFXEventAssetSpeedEntry* entries;
		};

		struct PhysicsSFXEventAssetMassEntry
		{
			float massThreshold;
			float hitSoundVolumeModifierMin;
			float hitSoundVolumeModifierMax;
			float hitSoundPitchModifierMin;
			float hitSoundPitchModifierMax;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetMassRule
		{
			int numentries;
			PhysicsSFXEventAssetMassEntry* entries;
		};

		struct PhysicsSFXEventAssetGravityEntry
		{
			bool gravity;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetGravityRule
		{
			int numentries;
			PhysicsSFXEventAssetGravityEntry* entries;
		};

		struct PhysicsSFXEventAssetAtmosphereEntry
		{
			bool atmosphere;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetAtmosphereRule
		{
			int numentries;
			PhysicsSFXEventAssetAtmosphereEntry* entries;
		};

		struct PhysicsSFXEventAssetCameraDistanceEntry
		{
			float distance;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetCameraDistanceRule
		{
			int numentries;
			PhysicsSFXEventAssetCameraDistanceEntry* entries;
		};

		struct PhysicsSFXEventAssetFrequencyEntry
		{
			int maxEvents;
			PhysicsSFXEventAssetRules rules;
		};

		struct PhysicsSFXEventAssetFrequencyRule
		{
			int numentries;
			PhysicsSFXEventAssetFrequencyEntry* entries;
		};

		union PhysicsSFXEventAssetRuleUnion
		{
			PhysicsSFXEventAssetSoundRule soundRule;
			PhysicsSFXEventAssetMaterialRule materialRule;
			PhysicsSFXEventAssetAngleRule angleRule;
			PhysicsSFXEventAssetSpeedRule speedRule;
			PhysicsSFXEventAssetMassRule massRule;
			PhysicsSFXEventAssetGravityRule gravityRule;
			PhysicsSFXEventAssetAtmosphereRule atmosphereRule;
			PhysicsSFXEventAssetCameraDistanceRule cameraDistanceRule;
			PhysicsSFXEventAssetFrequencyRule frequencyRule;
		};

		struct PhysicsSFXEventAssetRule
		{
			PhysicsSFXEventAssetRuleType type;
			PhysicsSFXEventAssetRuleUnion u;
		};

		struct PhysicsSFXEventAsset
		{
			const char* name;
			int priority;
			PhysicsSFXEventAssetRules rules;
		}; static_assert(sizeof(PhysicsSFXEventAsset) == 0x20);

		struct PhysicsVFXEventAssetRule;
		struct PhysicsVFXEventAssetRules
		{
			int numrules;
			PhysicsVFXEventAssetRule* rules;
		};

		enum PhysicsVFXEventAssetRuleType
		{
			Types_PhysicsVFXEventRule = 0x0,
			Types_PhysicsVFXEventParticleEffectRule = 0x1,
			Types_PhysicsVFXEventMaterialRule = 0x2,
			Types_PhysicsVFXEventAngleRule = 0x3,
			Types_PhysicsVFXEventSpeedRule = 0x4,
			Types_PhysicsVFXEventMassRule = 0x5,
			Types_PhysicsVFXEventGravityRule = 0x6,
			Types_PhysicsVFXEventAtmosphereRule = 0x7,
			Types_PhysicsVFXEventCameraDistanceRule = 0x8,
			Types_PhysicsVFXEventFrequencyRule = 0x9,
			Types_PhysicsVFXEventRuleCount = 0xA,
		};

		struct PhysicsVFXEventAssetParticleEffectRule
		{
			char* hitParticleEffectAlias;
			char* scrapeParticleEffectAlias;
		};

		struct PhysicsVFXEventAssetMaterialEntry
		{
			int surfaceType;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetMaterialRule
		{
			int numentries;
			PhysicsVFXEventAssetMaterialEntry* entries;
		};

		struct PhysicsVFXEventAssetAngleEntry
		{
			float angle;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetAngleRule
		{
			int numentries;
			PhysicsVFXEventAssetAngleEntry* entries;
		};

		struct PhysicsVFXEventAssetSpeedEntry
		{
			float speedThreshold;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetSpeedRule
		{
			int numentries;
			PhysicsVFXEventAssetSpeedEntry* entries;
		};

		struct PhysicsVFXEventAssetMassEntry
		{
			float massThreshold;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetMassRule
		{
			int numentries;
			PhysicsVFXEventAssetMassEntry* entries;
		};

		struct PhysicsVFXEventAssetGravityEntry
		{
			bool gravity;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetGravityRule
		{
			int numentries;
			PhysicsVFXEventAssetGravityEntry* entries;
		};

		struct PhysicsVFXEventAssetAtmosphereEntry
		{
			bool atmosphere;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetAtmosphereRule
		{
			int numentries;
			PhysicsVFXEventAssetAtmosphereEntry* entries;
		};

		struct PhysicsVFXEventAssetCameraDistanceEntry
		{
			float distance;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetCameraDistanceRule
		{
			int numentries;
			PhysicsVFXEventAssetCameraDistanceEntry* entries;
		};

		struct PhysicsVFXEventAssetFrequencyEntry
		{
			int maxEvents;
			PhysicsVFXEventAssetRules rules;
		};

		struct PhysicsVFXEventAssetFrequencyRule
		{
			int numentries;
			PhysicsVFXEventAssetFrequencyEntry* entries;
		};

		union PhysicsVFXEventAssetRuleUnion
		{
			PhysicsVFXEventAssetParticleEffectRule particleEffectRule;
			PhysicsVFXEventAssetMaterialRule materialRule;
			PhysicsVFXEventAssetAngleRule angleRule;
			PhysicsVFXEventAssetSpeedRule speedRule;
			PhysicsVFXEventAssetMassRule massRule;
			PhysicsVFXEventAssetGravityRule gravityRule;
			PhysicsVFXEventAssetAtmosphereRule atmosphereRule;
			PhysicsVFXEventAssetCameraDistanceRule cameraDistanceRule;
			PhysicsVFXEventAssetFrequencyRule frequencyRule;
		};

		struct PhysicsVFXEventAssetRule
		{
			PhysicsVFXEventAssetRuleType type;
			PhysicsVFXEventAssetRuleUnion u;
		};

		struct PhysicsVFXEventAsset
		{
			const char* name;
			int priority;
			PhysicsVFXEventAssetRules rules;
		}; static_assert(sizeof(PhysicsVFXEventAsset) == 0x20);

		struct PhysicsAsset
		{
			const char* name;
			unsigned int havokDataSize;
			char* havokData;
			char __pad0[8];
			int numConstraints;
			int numSFXEventAssets;
			void** sfxEventAssets;
			int numVFXEventAssets;
			void** vfxEventAssets;
			char __pad1[16];
		}; static_assert(sizeof(PhysicsAsset) == 0x50);

		struct PhysicsFXPipeline
		{
			const char* name;
			char __pad0[24];
		}; static_assert(sizeof(PhysicsFXPipeline) == 0x20);

		struct PhysicsFXShape
		{
			const char* name;
			unsigned int size;
			vec3_t* vecs;
		}; static_assert(sizeof(PhysicsFXShape) == 0x18);

		union XAnimIndices
		{
			char* _1;
			unsigned short* _2;
			void* data;
		};

		struct XAnimNotifyInfo
		{
			scr_string_t name;
			float time;
		};

		union XAnimDynamicFrames
		{
			char(*_1)[3];
			unsigned short(*_2)[3];
		};

		union XAnimDynamicIndices
		{
			char _1[1];
			unsigned short _2[1];
		};

		struct XAnimPartTransFrames
		{
			vec3_t mins;
			vec3_t size;
			XAnimDynamicFrames frames;
			XAnimDynamicIndices indices;
		};

		union XAnimPartTransData
		{
			XAnimPartTransFrames frames;
			vec3_t frame0;
		};

		struct XAnimPartTrans
		{
			unsigned short size;
			char smallTrans;
			XAnimPartTransData u;
		};

		struct XAnimDeltaPartQuatDataFrames2
		{
			short(*frames)[2];
			XAnimDynamicIndices indices;
		};

		union XAnimDeltaPartQuatData2
		{
			XAnimDeltaPartQuatDataFrames2 frames;
			short frame0[2];
		};

		struct XAnimDeltaPartQuat2
		{
			unsigned short size;
			XAnimDeltaPartQuatData2 u;
		};

		struct XAnimDeltaPartQuatDataFrames
		{
			short(*frames)[4];
			XAnimDynamicIndices indices;
		};

		union XAnimDeltaPartQuatData
		{
			XAnimDeltaPartQuatDataFrames frames;
			short frame0[4];
		};

		struct XAnimDeltaPartQuat
		{
			unsigned short size;
			XAnimDeltaPartQuatData u;
		};

		struct XAnimDeltaPart
		{
			XAnimPartTrans* trans;
			XAnimDeltaPartQuat2* quat2;
			XAnimDeltaPartQuat* quat;
		};

		struct XAnimParts
		{
			const char* name; // 0
			scr_string_t* names; // 8
			char* dataByte; // 16
			short* dataShort; // 24
			int* dataInt; // 32
			short* randomDataShort; // 40
			char* randomDataByte; // 48
			int* randomDataInt; // 56
			XAnimIndices indices; // 64
			XAnimNotifyInfo* notify; // 72
			XAnimDeltaPart* deltaPart; // 80
			unsigned int randomDataShortCount; // 88
			unsigned int randomDataByteCount; // 92
			unsigned int indexCount; // 96
			float framerate; // 100
			float frequency; // 104
			unsigned short dataByteCount; // 108
			unsigned short dataShortCount; // 110
			unsigned short dataIntCount; // 112
			unsigned short randomDataIntCount; // 114
			unsigned short numframes; // 116
			char flags; // 118
			char boneCount[10]; // 119
			char notifyCount; // 129
			char assetType; // 130
			char ikType; // 131
		}; static_assert(sizeof(XAnimParts) == 0x88);

		struct DObjAnimMat
		{
			float quat[4];
			float trans[3];
			float transWeight;
		};

		struct ReactiveMotionModelPart
		{
			float center[3];
			float stiffness;
		};

		struct XSurfaceCollisionAabb
		{
			unsigned short mins[3];
			unsigned short maxs[3];
		};

		struct XSurfaceCollisionNode
		{
			XSurfaceCollisionAabb aabb;
			unsigned short childBeginIndex;
			unsigned short childCount;
		};

		struct XSurfaceCollisionLeaf
		{
			unsigned short triangleBeginIndex;
		};

		struct XSurfaceCollisionTree
		{
			float trans[3];
			float scale[3];
			unsigned int nodeCount;
			XSurfaceCollisionNode* nodes;
			unsigned int leafCount;
			XSurfaceCollisionLeaf* leafs;
		};

		struct XRigidVertList
		{
			unsigned short boneOffset;
			unsigned short vertCount;
			unsigned short triOffset;
			unsigned short triCount;
			XSurfaceCollisionTree* collisionTree;
		};

		union PackedUnitVec
		{
			unsigned int packed;
		};

		union PackedTexCoords
		{
			unsigned int packed;
		};

		union GfxColor
		{
			unsigned char array[4];
			unsigned int packed;
		};

		struct GfxPackedVertex
		{
			float xyz[3];
			float binormalSign;
			GfxColor color;
			PackedTexCoords texCoord;
			PackedUnitVec normal;
			PackedUnitVec tangent;
		};

		struct GfxPackedMotionVertex
		{
			float xyz[3];
			float binormalSignAndHeight;
			GfxColor pieceIndex;
			PackedTexCoords texCoord;
			PackedUnitVec normal;
			PackedUnitVec tangent;
		};

		union GfxVertexUnion0
		{
			GfxPackedVertex* packedVerts0;
			GfxPackedMotionVertex* packedMotionVerts0;
			void* verts0;
		};

		struct Face
		{
			unsigned short v1;
			unsigned short v2;
			unsigned short v3;
		};

		struct XSurface // similar to iw6
		{
			unsigned short flags; // 0
			unsigned short vertCount; // 2
			unsigned short triCount; // 4
			char rigidVertListCount; // 6
			char subdivLevelCount; // 7
			short blendVertCounts[8]; // 8
			char __pad0[8];
			GfxVertexUnion0 verts0; // 32
			Face* triIndices; // 40
			char __pad1[24];
			XRigidVertList* rigidVertLists; // 72
			char __pad2[48];
			void* subdiv; // XSurfaceSubdivInfo* subdiv // 128
			unsigned int* blendVerts; // 136
			char __pad3[80];
			int partBits[8]; // 224
		}; static_assert(sizeof(XSurface) == 0x100);

		struct XModelSurfs
		{
			const char* name;
			XSurface* surfs;
			unsigned short numsurfs;
			int partBits[8];
		}; static_assert(sizeof(XModelSurfs) == 0x38);

		struct XModel
		{
			const char* name;
			char __pad0[728];
		}; static_assert(sizeof(XModel) == 0x2E0);

		struct MayhemModel
		{
			XModel* model;
		};

		struct MayhemTransBounds
		{
			vec3_t mins;
			vec3_t size;
		};

		struct GfxWrappedBaseBuffer
		{
			void* buffer; //ID3D12Resource* buffer;
			//GfxShaderBufferView view;
		};

		struct MayhemAnimFramesSplineCompressed
		{
			char* diskQuat;
			char* diskPos;
			unsigned __int16* diskQuatFrames;
			unsigned __int16* diskPosFrames;
			unsigned __int16* numDiskQuatFrames;
			unsigned __int16* numDiskPosFrames;
			MayhemTransBounds* transBounds;
			GfxWrappedBaseBuffer quat;
			GfxWrappedBaseBuffer pos;
			unsigned int quatStride;
			unsigned int posStride;
			unsigned int totalCompressedQuatFrames;
			unsigned int totalCompressedPosFrames;
		}; static_assert(sizeof(MayhemAnimFramesSplineCompressed) == 0x58);

		struct MayhemAnimFramesUncompressed
		{
			char* diskQuat;
			char* diskPos;
			MayhemTransBounds* transBounds;
			GfxWrappedBaseBuffer quat;
			GfxWrappedBaseBuffer pos;
			unsigned int quatStride;
			unsigned int posStride;
		}; static_assert(sizeof(MayhemAnimFramesUncompressed) == 0x30);

		union MayhemFramesUnion
		{
			void* data;
			MayhemAnimFramesSplineCompressed* splineCompressedFrames;
			MayhemAnimFramesUncompressed* uncompressedFrames;
		};

		struct MayhemDataKeysSplineCompressed
		{
			char* keys;
			unsigned __int16* numKeys;
			unsigned __int16* keyFrames;
			unsigned int totalCompressedKeyFrames;
			unsigned int numStreams;
			unsigned int keyStride;
		}; static_assert(sizeof(MayhemDataKeysSplineCompressed) == 0x28);

		struct MayhemDataKeysUncompressed
		{
			char* keys;
			unsigned int numStreams;
			unsigned int keyStride;
		}; static_assert(sizeof(MayhemDataKeysUncompressed) == 0x10);

		union MayhemDataChannelsUnion
		{
			void* data;
			MayhemDataKeysSplineCompressed* splineCompressedKeys;
			MayhemDataKeysUncompressed* uncompressedKeys;
		};

		struct MayhemAnim
		{
			MayhemFramesUnion frames;
			unsigned int numBones;
			unsigned int numFrames;
			float framerate;
			float frequency;
			unsigned int notifyCount;
			unsigned int dataChannelCount;
			bool isLooping;
			bool isSplineCompressed;
			bool quantizeQuats;
			bool quantizeTrans;
			bool quantizeChannels;
			XAnimNotifyInfo* notify;
			MayhemDataChannelsUnion dataChannels;
		}; static_assert(sizeof(MayhemAnim) == 56);

		struct MayhemObject
		{
			unsigned int modelIndex;
			unsigned int animIndex;
		};

		struct MayhemData
		{
			const char* name;
			XModel* preModel;
			XModel* postModel;
			unsigned int numModels;
			MayhemModel* models;
			unsigned int numAnims;
			MayhemAnim* anims;
			unsigned int numObjects;
			MayhemObject* objects;
			float length;
		}; static_assert(sizeof(MayhemData) == 0x50);

		struct Material
		{
			const char* name;
			char __pad0[0x110];
		}; static_assert(sizeof(Material) == 0x118);

		enum MapType : std::uint8_t
		{
			MAPTYPE_NONE = 0x0,
			MAPTYPE_INVALID1 = 0x1,
			MAPTYPE_1D = 0x2,
			MAPTYPE_2D = 0x3,
			MAPTYPE_3D = 0x4,
			MAPTYPE_CUBE = 0x5,
			MAPTYPE_ARRAY = 0x6,
			MAPTYPE_CUBE_ARRAY = 0x7,
			MAPTYPE_COUNT = 0x8,
		};

		struct GfxImageStreamData
		{
			unsigned short width;
			unsigned short height;
			unsigned int pixelSize;
		};

		struct GfxImage
		{
			char __pad0[24];
			DXGI_FORMAT imageFormat; // 24
			char flags; // 28
			char __pad1[3];
			MapType mapType; // 32
			char sematic; // 33
			char category; // 34
			unsigned char platform[2]; // 35
			char __pad2[3];
			unsigned int dataLen1; // 40
			unsigned int dataLen2; // 44
			unsigned short width; // 48
			unsigned short height; // 50
			unsigned short depth; // 52
			unsigned short numElements; // 54
			unsigned char mipmapCount; // 56
			bool streamed; // 57
			char __pad3[6];
			char* pixelData; // 64
			GfxImageStreamData streams[4]; // 72
			const char* name; // 104
		}; static_assert(sizeof(GfxImage) == 0x70);

		struct snd_volmod_info_t
		{
			char name[64];
			unsigned int id;
			float value;
		};

		struct SndGlobals
		{
			const char* name;
			float globalVolumeModifier;
			float binkVolumeModifier;
			unsigned int volmodinfoCount;
			snd_volmod_info_t* volmodinfo;
			char __pad0[176];
		}; static_assert(sizeof(SndGlobals) == 0xD0);

		struct SndBank
		{
			const char* name;
			const char* zone;
			const char* gameLanguage;
			const char* soundLanguage;
			char __pad0[320];
		};

		struct SndBankResident
		{
			SndBank bank;
		}; static_assert(sizeof(SndBankResident) == 0x160);

		struct SndBankTransient
		{
			const char* name;
			unsigned int elementCount;
			unsigned int* elements;
		}; static_assert(sizeof(SndBankTransient) == 0x18);

		struct LocalizeEntry
		{
			const char* name;
			const char* value;
		}; static_assert(sizeof(LocalizeEntry) == 0x10);

		struct RawFile
		{
			const char* name;
